use saloonBeauty;

-- заполнение таблицы мастера
insert into masters (masterCode, masterName, masterTel, servCode)
values
(1, 'Щюкина Алина', '+79184762135', 1),
(2, 'Окунёва Ольга', '+79001043789', 2),
(3, 'Сомова Татьяна', '+79384115764', 3),
(4, 'Таранкина Алла', '+79018654812', 4),
(5, 'Осетрова Наталья', '+79285671290', 5);

-- заполнение таблицы клиенты
insert into clients (clientCode, clientName, clientTel)
values
(1, 'Голубева Марина', '+79409812561'),
(2, 'Воробьёва Юлия', '+79187632881'),
(3, 'Чайкина Галина', '+79019742431'),
(4, 'Воронова Елизавета', '+79224236477'),
(5, 'Щеглова Екатерина', '+79390834512');

-- заполнение таблицы услуги
insert into servType (servTypeCode, servType)
values
(1, 'парикмахерские'),
(2, 'маникюр'),
(3, 'косметические'),
(4, 'массаж'),
(5, 'педикюр');